## Terraform Lint/Plan Results
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
cloudflare_record.mx-2: Refreshing state... [id=faafcadfad83b1236f4c929db14f3d18]
cloudflare_record.webmail: Refreshing state... [id=457b0a51b6b0d9041801788e0dfd917f]
cloudflare_record.www-a: Refreshing state... [id=5d3ab468a74e6757b07c36226406b661]
cloudflare_zone_settings_override.tmeit-se-settings: Refreshing state... [id=6a806c0199e15cdf23bb3017a90bf149]
cloudflare_record.smtp: Refreshing state... [id=5f6a7752e884e3c824aae558732f2fd0]
cloudflare_record.root-aaaa: Refreshing state... [id=5c120446a4bc1a2fb3eb480206844313]
cloudflare_record.www-aaaa: Refreshing state... [id=42ee94b3fab962b8b21d1487ec734fbd]
cloudflare_record._autodiscover_tcp: Refreshing state... [id=152e2e33d0bd2d72dfa140bb525f829f]
cloudflare_record.pop3: Refreshing state... [id=82cb3cd742c7d05bc2d03f25c59c82c3]
cloudflare_record.mx-1: Refreshing state... [id=7f7e451868fc1ffe53a7de678eb3bc93]
cloudflare_record.mail: Refreshing state... [id=f9cff3da6c43997e0e9eacaac8fbb589]
cloudflare_record.autoconfig: Refreshing state... [id=db6141ae25d9723d0cd72ff53df130e7]
cloudflare_record.mail2: Refreshing state... [id=60581cadb658f04d4d94bae9c8bfbbae]
cloudflare_record.webbmail: Refreshing state... [id=103b1308497abba1cb8bcc4af7c5264f]
cloudflare_record.root-a: Refreshing state... [id=9baadb4a0bef6e6e9e3fa50ab2bfe2c1]
cloudflare_record.imap: Refreshing state... [id=ac6aeafd9af224e07c88efdc9b5e4887]
b2_bucket.terraform-state: Refreshing state... [id=c33185c9297d9b5484380d18]
tls_private_key.terraform_access: Refreshing state... [id=ca7f120683c884d7607764350d41aebb404d6c46]
hcloud_server.testnode: Refreshing state... [id=24923737]
cloudflare_record.node1: Refreshing state... [id=db1e5ed222e96cdf5bff675f30815bfe]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_record._autodiscover_tcp will be created
  + resource "cloudflare_record" "_autodiscover_tcp" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_autodiscover._tcp"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "SRV"
      + value           = (known after apply)
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"

      + data {
          + name     = "tmeit.se"
          + port     = 443
          + priority = 100
          + proto    = "_tcp"
          + service  = "_autodiscover"
          + target   = "autodiscover.loopia.com.tmeit.se"
          + weight   = 1
        }
    }

  # cloudflare_record.autoconfig will be created
  + resource "cloudflare_record" "autoconfig" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "autoconfig"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "autoconfig.loopia.com."
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.imap will be created
  + resource "cloudflare_record" "imap" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "imap"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "mailcluster.loopia.se."
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.mail will be created
  + resource "cloudflare_record" "mail" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mail"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "mailcluster.loopia.se."
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.mail2 will be created
  + resource "cloudflare_record" "mail2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mail2"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "mail2.loopia.se."
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.mx-1 will be created
  + resource "cloudflare_record" "mx-1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 10
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "mailcluster.loopia.se."
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.mx-2 will be created
  + resource "cloudflare_record" "mx-2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 20
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "mail2.loopia.se."
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.node1 will be created
  + resource "cloudflare_record" "node1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "node1"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.pop3 will be created
  + resource "cloudflare_record" "pop3" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pop3"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "mailcluster.loopia.se."
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.root-a will be created
  + resource "cloudflare_record" "root-a" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "93.188.2.54"
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.root-aaaa will be created
  + resource "cloudflare_record" "root-aaaa" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "AAAA"
      + value           = "2a02:250:0:8::52"
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.smtp will be created
  + resource "cloudflare_record" "smtp" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "smtp"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "mailcluster.loopia.se."
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.webbmail will be created
  + resource "cloudflare_record" "webbmail" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "webbmail"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "webmail.loopia.se."
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.webmail will be created
  + resource "cloudflare_record" "webmail" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "webmail"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "webmail.loopia.se."
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.www-a will be created
  + resource "cloudflare_record" "www-a" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "93.188.2.54"
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.www-aaaa will be created
  + resource "cloudflare_record" "www-aaaa" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "AAAA"
      + value           = "2a02:250:0:8::52"
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # hcloud_firewall.myfirewall will be created
  + resource "hcloud_firewall" "myfirewall" {
      + id     = (known after apply)
      + labels = (known after apply)
      + name   = "my-firewall"

      + rule {
          + destination_ips = []
          + direction       = "in"
          + protocol        = "icmp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "22"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "443"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "6443"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
    }

  # hcloud_server.testnode must be replaced
-/+ resource "hcloud_server" "testnode" {
      + backup_window              = (known after apply)
      ~ datacenter                 = "hel1-dc2" -> (known after apply)
      ~ firewall_ids               = [] -> (known after apply)
      ~ id                         = "24923737" -> (known after apply)
      ~ ipv4_address               = "65.21.188.62" -> (known after apply)
      ~ ipv6_address               = "2a01:4f9:c012:6063::1" -> (known after apply)
      ~ ipv6_network               = "2a01:4f9:c012:6063::/64" -> (known after apply)
      - labels                     = {} -> null
        name                       = "testnode"
      ~ status                     = "running" -> (known after apply)
      ~ user_data                  = "Is2uiuzq4knTsnt4q6MQwB/gU8E=" -> "FjlCFKidd3CstxN+nzqe8kt+vyw=" # forces replacement
        # (9 unchanged attributes hidden)

      - public_net {
          - ipv4         = 0 -> null
          - ipv4_enabled = true -> null
          - ipv6         = 0 -> null
          - ipv6_enabled = true -> null
        }
      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

Plan: 18 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + ipv4_address = (known after apply)
  + k3s_channel  = "v1.25"
  + ssh_key      = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @JustinLex, Action: `pull_request`*